nixos/home-manager/emacs/config.org
* KEYBINDINGS
#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup)

  ;; set up 'SPC' as the global leader key
  (general-create-definer dt/leader-keys
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "M-SPC") ;; access leader in insert mode

  (dt/leader-keys
    "SPC" '(counsel-M-x :wk "Counsel M-x")

    "TAB" '(tab-bar-switch-to-next-tab :wk "Window Right")
    "n" '(tab-bar-new-tab :wk "New Tab")
    "x" '(tab-bar-close-tab :wk "Quit Emacs (No Saves)")
    "q" '(delete-frame :wk "Quit Emacs (No Saves)")
    "." '(find-file :wk "Find file")
    "f c" '((lambda () (interactive) (find-file "~/.nixos-config/nixos/home-manager/emacs/config.org")) :wk "Edit emacs config")
    "f r" '(counsel-recentf :wk "Find recent files"))

  (dt/leader-keys
    "b" '(:ignore t :wk "buffer")
    "b b" '(switch-to-buffer :wk "Switch buffer")
    "b i" '(ibuffer :wk "Ibuffer")
    "b k" '(kill-this-buffer :wk "Kill this buffer")
    "b n" '(next-buffer :wk "Next buffer")
    "b p" '(previous-buffer :wk "Previous buffer")
    "b r" '(revert-buffer :wk "Reload buffer"))

  (dt/leader-keys
    "d" '(:ignore t :wk "Dired")
    "d d" '(dired :wk "Open dired")
    "d c" '(dired-create-empty-file :wk "Create File")
    "d a" '(dired-create-directory :wk "Create Directory")
    "d j" '(dired-jump :wk "Dired jump to current")
    "d n" '(neotree-dir :wk "Open directory in neotree")
    "d p" '(peep-dired :wk "Peep-dired"))

  (dt/leader-keys
    "r" '(:ignore t :wk "Misc Tools")
    "r f" '(:ignore t :wk "Elfeed")
    "r f f" '(elfeed :wk "Open Elfeed")
    "r f l" '(elfeed-goodies/show-link-hint :wk "Open Article Link")
    "r f u" '(elfeed-update :wk "Update Feed"))

  (dt/leader-keys
    "e" '(:ignore t :wk "Eshell/Evaluate")    
    "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
    "e d" '(eval-defun :wk "Evaluate defun containing or after point")
    "e e" '(eval-expression :wk "Evaluate and elisp expression")
    "e h" '(counsel-esh-history :which-key "Eshell history")
    "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
    "e r" '(eval-region :wk "Evaluate elisp in region"))

 (dt/leader-keys
    "h" '(:ignore t :wk "Help")
    "h f" '(describe-function :wk "Describe function")
    "h v" '(describe-variable :wk "Describe variable")
    ;;"h r r" '((lambda () (interactive) (load-file "~/.config/emacs/init.el")) :wk "Reload emacs config"))
    "h r r" '(reload-init-file :wk "Reload emacs config"))
(dt/leader-keys
  "m" '(:ignore t :wk "Org")
  "m j" '(org-babel-next-src-block :wk "Next Source Block")
  "m k" '(org-babel-previous-src-block :wk "Prev Source Block")
  "m a" '(org-agenda :wk "Org agenda")
  "m e" '(org-export-dispatch :wk "Org export dispatch")
  "m p" '(org-display-inline-images :wk "Org Display Images")
  "m i" '(org-toggle-item :wk "Org toggle item")
  "m t" '(org-todo :wk "Org todo")
  "m B" '(org-babel-tangle :wk "Org babel tangle")
  "m T" '(org-todo-list :wk "Org todo list")
  "m s" '(org-edit-src-code :wk "Edit Source Block")
  "m m" '(org-babel-execute-src-block :wk "Babel execute Block")
  "m n" '(org-babel-execute-buffer :wk "Babel execute Buffer"))

(dt/leader-keys
  "m b" '(:ignore t :wk "Tables")
  "m b -" '(org-table-insert-hline :wk "Insert hline in table"))

(dt/leader-keys
  "m d" '(:ignore t :wk "Date/deadline")
  "m d t" '(org-time-stamp :wk "Org time stamp"))


(dt/leader-keys
  "g" '(:ignore t :wk "Magit")
  "g g" '(magit :wk "Open Magit"))

(dt/leader-keys
  "p" '(projectile-command-map :wk "Projectile"))

  (dt/leader-keys
    "o" '(:ignore t :wk "Toggle")
    "o l" '(display-line-numbers-mode :wk "Toggle line numbers")
    "o n" '(neotree-toggle :wk "Toggle neotree file viewer")
    "o t" '(visual-line-mode :wk "Toggle truncated lines")
    "o v" '(vterm-toggle :wk "Toggle vterm"))

  (dt/leader-keys
    "j" '(:ignore t :wk "Jupyter")
    "j l" '(jupyter-server-launch-kernel :wk "Launch Kernels")
    "j s" '(jupyter-server-list-kernels :wk "List Kernels"))

  (dt/leader-keys
    "l" '(:ignore t :wk "LSP")
    "l d" '(lsp-ui-doc-glance :wk "Doc")
    "l c" '(comment-line :wk "Comment lines"))

  (dt/leader-keys
    "c" '(:ignore t :wk "Company")
    "c c" '(lsp-ui-doc-glance :wk "Complete"))

  (dt/leader-keys 
    "s" '(:ignore t :wk "Split")
    ;; Window splits
    "s c" '(evil-window-delete :wk "Close window")
    "s n" '(evil-window-new :wk "New window")
    "s h" '(evil-window-split :wk "Horizontal split window")
    "s v" '(evil-window-vsplit :wk "Vertical split window"))


  (dt/leader-keys
    "t" '(:ignore t :wk "Tab Bar")
    "t h" '(tab-bar-switch-to-prev-tab :wk "Tab left")
    "t l" '(tab-bar-switch-to-next-tab :wk "Tab right")
    "t c" '(tab-bar-close-tab :wl "Close Tabs"))

  (dt/leader-keys
    "w" '(:ignore t :wk "Windows")
    ;; Window motions
    "w h" '(evil-window-left :wk "Window left")
    "w j" '(evil-window-down :wk "Window down")
    "w k" '(evil-window-up :wk "Window up")
    "w l" '(evil-window-right :wk "Window right")
    "w w" '(evil-window-next :wk "Goto next window")
    ;; Move Windows
    "w H" '(buf-move-left :wk "Buffer move left")
    "w J" '(buf-move-down :wk "Buffer move down")
    "w K" '(buf-move-up :wk "Buffer move up")
    "w L" '(buf-move-right :wk "Buffer move right"))


(define-key evil-normal-state-map (kbd "C-h") #'evil-window-left)
(define-key evil-normal-state-map (kbd "C-j") #'evil-window-down)
(define-key evil-normal-state-map (kbd "C-k") #'evil-window-up)
(define-key evil-normal-state-map (kbd "C-l") #'evil-window-right)

)
#+end_src

* ALL THE ICONS
This is an icon set that can be used with dashboard, dired, ibuffer and other Emacs programs.
#+begin_src emacs-lisp
(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))

(use-package all-the-icons-dired
  :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))
#+end_src

* FONTS

#+begin_src emacs-lisp
  (set-face-attribute 'default nil
    :font "SauceCodePro Nerd Font"
    :height 110
    :weight 'medium)
  (set-face-attribute 'variable-pitch nil
    :font "SauceCodePro Nerd Font"
    :height 120
    :weight 'medium)
  (set-face-attribute 'fixed-pitch nil
    :font "SauceCodePro Nerd Font"
    :height 110
    :weight 'medium)
  ;; Makes commented text and keywords italics.
  ;; This is working in emacsclient but not emacs.
  ;; Your font must have an italic face available.
  (set-face-attribute 'font-lock-comment-face nil
    :slant 'italic)
  (set-face-attribute 'font-lock-keyword-face nil
    :slant 'italic)

  ;; This sets the default font on all graphical frames created after restarting Emacs.
  ;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
  ;; are not right unless I also add this method of setting the default font.
  (add-to-list 'default-frame-alist '(font . "SauceCodePro Nerd Font"))
  ;; Uncomment the following line if line spacing needs adjusting.
  (setq-default line-spacing 0.12)
  #+end_src

** Disable Menubar, Toolbars and Scrollbars
#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

** Display Line Numbers and Truncated Lines
#+begin_src emacs-lisp
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
#+end_src

